In [147]:
working_data={
    "name_first":["shiva","honey",'kannama',"subhash"],
    "name_last":["venkatesan","rajkumar","rajkumar","venkatesan"],
    "mail_ID":["shiva@hotmail.com","honey@hotmail.com","kannama@hotmail.com","bose@hotmail.com"]
}

In [148]:
import pandas as pd

In [149]:
df=pd.DataFrame(working_data)

In [150]:
df

  name_first   name_last              mail_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [151]:
df.columns

Index(['name_first', 'name_last', 'mail_ID'], dtype='object')

In [152]:
df.columns=['First_name','last_name','Mail_id']

In [153]:
df

  First_name   last_name              Mail_id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [154]:
df.columns=[x.upper() for x in df.columns]

In [155]:
df

  FIRST_NAME   LAST_NAME              MAIL_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [156]:
df.columns =[x.upper() for x in df.columns]

In [157]:
df

  FIRST_NAME   LAST_NAME              MAIL_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [158]:
df.columns =df.columns.str.replace('FIRST_NAME','original_name')

In [159]:
df

  original_name   LAST_NAME              MAIL_ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [160]:
df.columns =df.columns.str.replace('_',' ')

In [161]:
df

  original name   LAST NAME              MAIL ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [162]:
df.columns =df.columns.str.upper()

In [163]:
df

  ORIGINAL NAME   LAST NAME              MAIL ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [164]:
df.columns =df.columns.str.replace(' ','_')

In [165]:
df

  ORIGINAL_NAME   LAST_NAME              MAIL_ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [166]:
df.rename(columns={'ORIGINAL_NAME':'first_name','LAST_NAME':'second_name','MAIL_ID':'mail__id'},inplace=True)

In [167]:
df

  first_name second_name             mail__id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [168]:
df

  first_name second_name             mail__id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [169]:
df.loc[2,['second_name','mail__id']]=['rk','adirk@hotmail.com']

In [170]:
df

  first_name second_name           mail__id
0      shiva  venkatesan  shiva@hotmail.com
1      honey    rajkumar  honey@hotmail.com
2    kannama          rk  adirk@hotmail.com
3    subhash  venkatesan   bose@hotmail.com

In [172]:
df.loc[2,['second_name']]=['S/o rajendran']

In [173]:
df

  first_name    second_name               mail__id
0      shiva     venkatesan      shiva@hotmail.com
1      honey       rajkumar      honey@hotmail.com
2     adiraa  S/o rajendran  adiraarkj@hotmail.com
3    subhash     venkatesan       bose@hotmail.com

In [171]:
df.loc[2]=['adiraa','rkj','adiraarkj@hotmail.com']

In [81]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash  venkatesan       bose@hotmail.com

In [82]:
filt=( df ['mail__id']=='bose@hotmail.com')
df[filt]['second_name']='abc'

C:\Users\SIVA\AppData\Local\Temp\ipykernel_15964\2491011517.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['second_name']='abc'

In [176]:
filt=( df ['mail__id']=='bose@hotmail.com')
df.loc[filt,'second_name']='abc'

In [177]:
df

  first_name    second_name               mail__id
0      shiva     venkatesan      shiva@hotmail.com
1      honey       rajkumar      honey@hotmail.com
2     adiraa  S/o rajendran  adiraarkj@hotmail.com
3    subhash            abc       bose@hotmail.com

In [178]:
df['mail__id']=df['mail__id'].str.upper()

In [179]:
df

  first_name    second_name               mail__id
0      shiva     venkatesan      SHIVA@HOTMAIL.COM
1      honey       rajkumar      HONEY@HOTMAIL.COM
2     adiraa  S/o rajendran  ADIRAARKJ@HOTMAIL.COM
3    subhash            abc       BOSE@HOTMAIL.COM

In [87]:
df['mail__id']=df['mail__id'].str.lower()

In [88]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash         abc       bose@hotmail.com

In [89]:
apply 
map
applymap
replace
apply

NameError: name 'apply' is not defined

In [181]:
df["mail__id"].apply(len)

0    17
1    17
2    21
3    16
Name: mail__id, dtype: int64

In [91]:
def update_email(mail__id):
    return mail__id.upper()

In [92]:
df['mail__id'].apply(update_email)

0        SHIVA@HOTMAIL.COM
1        HONEY@HOTMAIL.COM
2    ADIRAARKJ@HOTMAIL.COM
3         BOSE@HOTMAIL.COM
Name: mail__id, dtype: object

In [93]:
df['mail__id']=df['mail__id'].apply(update_email)

In [94]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      SHIVA@HOTMAIL.COM
1      honey    rajkumar      HONEY@HOTMAIL.COM
2     adiraa         rkj  ADIRAARKJ@HOTMAIL.COM
3    subhash         abc       BOSE@HOTMAIL.COM

In [95]:
df['mail__id']=df['mail__id'].apply(lambda x :x.lower())

In [96]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash         abc       bose@hotmail.com

In [97]:
df.apply (len)

first_name     4
second_name    4
mail__id       4
dtype: int64

In [182]:
df.apply(len,axis=0)

first_name     4
second_name    4
mail__id       4
dtype: int64

In [113]:
import pandas as pd

In [114]:
s=pd.series()

AttributeError: module 'pandas' has no attribute 'series'

In [115]:
list(df)

['first_name', 'second_name', 'mail__id']

In [109]:
df.apply(pd.series.min)

AttributeError: module 'pandas' has no attribute 'series'

In [117]:
 df.apply(lambda x :x.min())

first_name                    adiraa
second_name                      abc
mail__id       adiraarkj@hotmail.com
dtype: object

In [118]:
df.applymap(len)

   first_name  second_name  mail__id
0           5           10        17
1           5            8        17
2           6            3        21
3           7            3        16

In [121]:
df.applymap (str.lower)

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash         abc       bose@hotmail.com

In [122]:
df['first_name'].map({"shiva":"subash","honey":"Honey","adiraa":"adi"})

0    subash
1     Honey
2       adi
3       NaN
Name: first_name, dtype: object

In [123]:
df['first_name'].replace({"shiva":"subash","honey":"Honey","adiraa":"adi"})

0     subash
1      Honey
2        adi
3    subhash
Name: first_name, dtype: object

In [124]:
df['first_name']=df['first_name'].replace({"shiva":"subash","honey":"Honey","adiraa":"adi"})

In [125]:
df

  first_name second_name               mail__id
0     subash  venkatesan      shiva@hotmail.com
1      Honey    rajkumar      honey@hotmail.com
2        adi         rkj  adiraarkj@hotmail.com
3    subhash         abc       bose@hotmail.com